package arthur.dy.lee.blank.medium;

/**
 * 36. 有效的数独
 * <p>
 * 请你判断一个 9 x 9 的数独是否有效。只需要 根据以下规则 ，验证已经填入的数字是否有效即可。
 * <p>
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。（请参考示例图）
 * <p>
 * 注意：
 * 一个有效的数独（部分已被填充）不一定是可解的。
 * 只需要根据以上规则，验证已经填入的数字是否有效即可。
 * 空白格用 '.' 表示。
 * <p>
 * 提示：
 * board.length == 9
 * board[i].length == 9
 * board[i][j] 是一位数字（1-9）或者 '.'
 */
public class _36_isValidSudoku {

    public static boolean isValidSudoku(char[][] board) {

        return true;
    }

    public static void main(String[] args) {
        //        char[][] table1 = {
        //                { '5', '3', '.', '.', '7', '.', '.', '.', '.' },
        //                { '6', '.', '.', '1', '9', '5', '.', '.', '.' },
        //                { '.', '9', '8', '.', '.', '.', '.', '6', '.' },
        //                { '8', '.', '.', '.', '6', '.', '.', '.', '3' },
        //                { '4', '.', '.', '8', '.', '3', '.', '.', '1' },
        //                { '7', '.', '.', '.', '2', '.', '.', '.', '6' },
        //                { '.', '6', '.', '.', '.', '.', '2', '8', '.' },
        //                { '.', '.', '.', '4', '1', '9', '.', '.', '5' },
        //                { '.', '.', '.', '.', '8', '.', '.', '7', '9' }
        //        };
        //        System.out.println(_36_isValidSudoku.isValidSudoku(table1));

        char[][] table2 = {
                { '8', '3', '.', '.', '7', '.', '.', '.', '.' },
                { '6', '.', '.', '1', '9', '5', '.', '.', '.' },
                { '.', '9', '8', '.', '.', '.', '.', '6', '.' },
                { '8', '.', '.', '.', '6', '.', '.', '.', '3' },
                { '4', '.', '.', '8', '.', '3', '.', '.', '1' },
                { '7', '.', '.', '.', '2', '.', '.', '.', '6' },
                { '.', '6', '.', '.', '.', '.', '2', '8', '.' },
                { '.', '.', '.', '4', '1', '9', '.', '.', '5' },
                { '.', '.', '.', '.', '8', '.', '.', '7', '9' }
        };
        System.out.println(_36_isValidSudoku.isValidSudoku(table2));
    }
}
